src/main/resources/HIPMessageServer.wsdl

<!--
 Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01.
-->
<!--
 Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01.
-->
<definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="urn:hl7-org:v3" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="urn:hl7-org:v3" name="HIPMessageServerService">
    <wsp:Policy wsu:Id="HIPMessageServerPortBinding_MTOM_Policy">
        <ns1:OptimizedMimeSerialization xmlns:ns1="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization" wsp:Optional="true"/>
    </wsp:Policy>
    <types/>
    <message name="HIPMessageServer">
        <part name="action" type="xsd:string"/>
        <part name="message" type="xsd:string"/>
    </message>
    <message name="HIPMessageServerResponse">
        <part name="return" type="xsd:string"/>
    </message>
    <portType name="HIPMessageServer">
        <operation name="HIPMessageServer" parameterOrder="action message">
            <input wsam:Action="urn:hl7-org:v3:HIPMessageServer:HIPMessageServerRequest" message="tns:HIPMessageServer"/>
            <output wsam:Action="urn:hl7-org:v3:HIPMessageServer:HIPMessageServerResponse" message="tns:HIPMessageServerResponse"/>
        </operation>
    </portType>
    <binding name="HIPMessageServerPortBinding" type="tns:HIPMessageServer">
        <wsp:PolicyReference URI="#HIPMessageServerPortBinding_MTOM_Policy"/>
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
        <operation name="HIPMessageServer">
            <soap12:operation soapAction=""/>
            <input>
                <soap12:body use="literal" namespace="urn:hl7-org:v3"/>
            </input>
            <output>
                <soap12:body use="literal" namespace="urn:hl7-org:v3"/>
            </output>
        </operation>
    </binding>
    <service name="HIPMessageServerService">
        <port name="HIPMessageServerPort" binding="tns:HIPMessageServerPortBinding">
            <soap12:address location="http://118.122.165.33:10020/services/HIPMessageServer"/>
        </port>
    </service>
</definitions>